test/site/content-org/all-posts.org
#+HUGO_BASE_DIR: ../
#+SEQ_TODO: TODO DRAFT DONE
#+PROPERTY: header-args :eval no
#+MACRO: doc [[https://ox-hugo.scripter.co/doc/$1][$2]]

**** No TOC in Summary
:PROPERTIES:
:EXPORT_FILE_NAME: no-toc-in-summary
:EXPORT_OPTIONS: toc:t
:END:
By default, Hugo will dump everything at the beginning of a post into
its =.Summary= (See [[https://gohugo.io/content-management/summaries/][Hugo content summaries]]). As TOC enabled using the
export option like =toc:t= is inserted at the beginning of a post, TOC
will be shown in that summary too!

#+HUGO: more

***** =ox-hugo='s Solution
=ox-hugo= helps prevent that with a workaround.. it inserts a special
HTML comment *=<!--endtoc-->=* after the TOC.

It is important to insert a user-defined summary split by using
=#+HUGO: more=. Otherwise it is very likely that the TOC is big enough
to exceed the Hugo-defined max-summary length and so the
=<!--endtoc-->= that appears *after* the TOC never gets parsed.

#+BEGIN_QUOTE
*Always use =#+HUGO: more= when you enable Org generated TOC's.*
#+END_QUOTE

In your site's Hugo template, you can then filter that out with
something like:
***** Snippet
#+BEGIN_SRC html
{{ $summary_splits := split .Summary "<!--endtoc-->" }}
{{ if eq (len $summary_splits) 2 }}
    <!-- If that endtoc special comment is present, output only the part after that comment as Summary. -->
    {{ index $summary_splits 1 | safeHTML }}
{{ else }}
    <!-- Print the whole Summary if endtoc special comment is not found. -->
    {{ .Summary }}
{{ end }}
#+END_SRC
***** Example
See this test site's [[https://github.com/kaushalmodi/ox-hugo/blob/master/test/site/themes/bare_min/layouts/_default/summary.html][=summary.html=]] as an example.
